app/controllers/notices_controller.rb

SELECT "notices".* FROM "notices"
---
  def index
    @notices = Notice.all.reverse

INSERT INTO "notices" ("title", "author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Twin Peaks"], ["author", "Martha"], ["content", "This is a test of doing a post"], ["created_at", "2017-09-05 19:07:31.200810"], ["updated_at", "2017-09-05 19:07:31.200810"]]
---
  def create
    @notice = Notice.new(notice_params)

    if @notice.save

SELECT  "notices".* FROM "notices" WHERE "notices"."id" = $1 LIMIT $2  [["id", 55], ["LIMIT", 1]]
---
    def set_notice
      @notice = Notice.find(params[:id])